[
    {
        "name": "Portfolio Website",
        "slug": "portfolio",
        "subtitle": "A website to display my skills and best projects so far.",
        "description": "In order to bring all my projects together in a place, I created a Portfolio Website. This website contains information about me. There is a short Introduction, tools I work with, skills I possess and of course, my projects. It also contains Links to view the source code of my projects. For the Projects I have deployed on a domain, I also provide links to view and interact with them. This website was built with React JS, styled with Tailwind CSS and the contact functionality implemented with Email JS.",
        "images": [
            "https://i.imgur.com/SW6gSeb.png",
            "https://i.imgur.com/l19HDDX.png",
            "https://i.imgur.com/3Ueznhj.png"
        ],
        "stack": [
            "React JS",
            "Tailwind CSS",
            "JavaScript",
            "Email JS"
        ],
        "links": [
            {
                "name": "Source Code",
                "src": "https://github.com/enyichiaagu/portfolio"
            }
        ]
    },
    {
        "name": "Linx",
        "slug": "linx",
        "subtitle": "Access your favorite resources on the internet with any device.",
        "description": "This is a Full Stack project built with Mongo DB, Express, React and Node JS (MERN). It is a central store for saving favorite internet links especially for users with multiple devices. A user creates a new account or logs in if they already have one. Once Logged in, they have access to all the links they have saved on their accounts. They can also manage their links by adding, deleting or renaming them. This project demonstrates CRUD operations in the MERN Stack.",
        "images": [
            "https://i.imgur.com/RFnsEoS.png",
            "https://i.imgur.com/SRM8H8l.png",
            "https://i.imgur.com/QewBjZw.png"
        ],
        "stack": [
            "Mongo DB",
            "React JS",
            "Express JS",
            "Node JS",
            "CSS"
        ],
        "links": [
            {
                "name": "Source Code (Front-End)",
                "src": "https://github.com/enyichiaagu/linx"
            },
            {
                "name": "Source Code (Back-End)",
                "src": "https://github.com/enyichiaagu/linx-server"
            },
            {
                "name": "Live",
                "src": "https://linxio.netlify.app"
            }
        ]
    },
    {
        "name": "Crypto CLI",
        "slug": "crypto-cli",
        "subtitle": "A Command Line Interface for viewing live prices of selected Cryptocurrencies and Tokens",
        "description": "This project demonstrates the ability of React JS to work on the Command Line. It is made possible through a popular library called Ink. The project brings React's declarative approach to designing User Interfaces (UI), to the Command Line. The live cryptocurrency data is gotten from the CoinGecko API and Axios is the library used to fetch the data. An article on the build process was documented on freeCodeCamp.",
        "images": [
            "https://i.imgur.com/dyWcoME.png",
            "https://i.imgur.com/14FJNAu.png"
        ],
        "stack": [
            "React JS",
            "Node JS"
        ],
        "links": [
            {
                "name": "Article on freeCodeCamp",
                "src": "https://freecodecamp.org/news/react-js-ink-cli-tutorial/"
            },
            {
                "name": "Source Code",
                "src": "https://github.com/enyichiaagu/crypto-cli"
            }
        ]
    },
    {
        "name": "Flames",
        "slug": "flames",
        "subtitle": "A fun game that uses the \"FLAMES\" rule to check the compatibility of lovers.",
        "description": "Calculation of the results using the \"FLAMES\" rule was done with JavaScript. This project demonstrates Document Object Model (DOM) manipulation and CSS Transitions. It also features dark and light mode. The color scheme was inspired by a common interpretation of Pink to convey strong feelings of affection.",
        "images": [
            "https://i.imgur.com/N8HgwL1.png",
            "https://i.imgur.com/YX0BUXS.png",
            "https://i.imgur.com/zXQ9Swi.png"
        ],
        "stack": [
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "links": [
            {
                "name": "Source Code",
                "src": "https://github.com/enyichiaagu/flames"
            },
            {
                "name": "Live",
                "src": "https://yichflames.netlify.app"
            }
        ]
    },
    {
        "name": "Chatbot",
        "slug": "chatbot",
        "subtitle": "A Chatbot that can reply to simple commands and tell jokes.",
        "description": "In this project, I designed the User Interface (UI) of the Chatbot using CSS. The server of the project was built with Flask, a web server side scripting framework for the Python Programming Language. This bot can reply to simple messages and tell great jokes.",
        "images": [
            "https://i.imgur.com/X5NjU9T.png",
            "https://i.imgur.com/sHZlmZe.png",
            "https://i.imgur.com/y2WYoAK.png"
        ],
        "stack": [
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "links": [
            {
                "name": "Source Code",
                "src": "https://github.com/enyichiaagu/chat_bot"
            },
            {
                "name": "Live",
                "src": "https://dan-chatbot.herokuapp.com/"
            }
        ]
    },
    {
        "name": "Gradient Generator",
        "slug": "gradient-generator",
        "subtitle": "Generate a CSS Color Gradient with up to five different colors.",
        "description": "This project is a website that generates code on CSS Gradients. The user can select up to five different colors on a gradient. The user can also choose from four different styles of a gradient. This Web App also provides a random button for generating completely random gradients with different colors. The Web App was styled with SCSS.",
        "images": [
            "https://i.imgur.com/jN9YyrZ.png",
            "https://i.imgur.com/9g55jOo.png",
            "https://i.imgur.com/891Neb8.png"
        ],
        "stack": [
            "HTML",
            "Sass",
            "JavaScript"
        ],
        "links": [
            {
                "name": "Source Code",
                "src": "https://github.com/enyichiaagu/gradient-generator"
            },
            {
                "name": "Live",
                "src": "https://color-gradient-generator.netlify.app/"
            }
        ]
    }
]